{
"saravanan": "Hello Saravanan,\n\nAs you probably know by now, I’m leaving Kinettix and before I go, I just really wanted to say something to you.\n\nThank you. Honestly, thank you for everything.\n\nFrom the very beginning, you’ve been more than just a team lead/manager to me. You’ve been a mentor, someone I looked up to and learned so much from. Your guidance and support helped me grow not just as a tester, but as a person. You believed in me, even during times I doubted myself. That kind of trust meant a lot.\n\nYou’ve always treated us like family, scolding us when needed, pushing us to do better, not because you were being hard on us, but because you genuinely cared. I’ve always felt that. And I’ve always respected you deeply for it.\n\nEven though we’ve never met in person, I always felt your presence in the team. Your leadership, your guidance, and your care were always there and that made a big difference.\n\nI’ve never seen you as just an office mate or a boss. To me, you’ve always been more than that. I’ll carry the lessons you taught me wherever I go, and I’ll always be grateful for the time I got to work with you.\n\nI won’t forget you, and I wish you all the best always.\n\nTake care always – Ramon",
"devs": "Hello Dev Team,\n\nBefore my last day, I just wanted to take a moment to sincerely thank all of you.\n\nWorking with such a smart, passionate, and collaborative group of developers has been one of the highlights of my time at Kinettix. I’ve learned so much from observing how each of you approaches challenges, solves problems, and constantly pushes to improve the system.\n\nThank you for being open to feedback, for the knowledge sharing, and for the day-to-day support, whether it was reviewing a ticket, jumping on a quick call to debug, or just checking in. You’ve made QA work smoother and more meaningful.\n\nI genuinely appreciated being part of this team, and I’m proud of everything we’ve accomplished together. Keep building amazing things, keep learning, and keep supporting each other.\n\nWishing all of you continued growth and success, both professionally and personally.\n\nSalamat and all the best - Ramon",
"margaux": "Hello Margaux,\n\nBefore my last day, I just wanted to take a moment to thank you for joining the team. Even though we only had a short time working together, I’ve already seen the impact you’ve made.\n\nYou may be new to the team and still gaining experience in testing, but your attitude, dedication, and willingness to learn have truly stood out. I’ve worked with many talented QAs before, and I can confidently say, you have those same qualities.\n\nMy advice moving forward is simple: keep learning. You’ve already started building a strong foundation and a good understanding of our product and system. You bring fresh perspectives, openness to feedback, and a real drive to grow—use all of that to your advantage.\n\nYou’ve taken great steps in manual testing, and now that you’re starting to explore automation, I can already see a bright future ahead for you. Absorb all the knowledge and experiences that come your way. Don’t be afraid to make mistakes—that’s how we grow. Use those moments to become even better.\n\nI have high hopes for you, Margaux. I truly believe you’ll go far and achieve even more than I did. And who knows, maybe someday our paths will cross again, and by then, you’ll be leading the QA team yourself.\n\nWishing you all the best in your journey ahead.\n\nTake care – Ramon",
"albert": "Hello Mac,\n\nBefore my last day, I just wanted to take a moment to thank you.\n\nIt’s truly been great working with someone as talented and dependable as you. We may not have talked often, but whenever we did, our conversations were always meaningful, and through those moments, I got to know the kind of person you are.\n\nYou’re excellent at what you do—skilled, driven, and always striving to make things better. I’m really glad I had the chance to work with someone like you, not as a QA, not as a developer, but as a dedicated and sharp IT Helpdesk Manager who made a real difference to the whole Kinettix organization.\n\nI still remember when I interviewed you—even back then, I had a feeling you were the right person for the role. And you’ve gone above and beyond that expectation ever since.\n\nThank you again for the opportunity to work with you and get to know you. It’s truly been a pleasure having you as a teammate. Let me know if you're visiting Cebu, I will be glad to meet you.\n\nWishing you all the best – Ramon",
"keziah": "Hello Keziah,\n\nBefore my last day, I just wanted to take a moment to sincerely thank you.\n\nWe may have sat in the same room without many personal conversations, but even in that quiet space, I learned a lot just by observing you. The way you carry yourself, how you lead your team, and the calm confidence you bring to your work—it all made an impression on me. You and Kriff have both been sources of quiet inspiration for me, and part of the reason I always strived to do my best.\n\nI’ve always felt the respect you had for me, and I truly hope you felt the same from me. It was a pleasure working alongside you, and I’m genuinely grateful for the small conversations we shared—they meant more than you might think.\n\nGood luck and congratulations on your upcoming blessing! Wishing you and your growing family all the love and joy in the world.\n\nTake care – Ramon",
"cecilio": "Hello Cecilio,\n\nFirst of all — congratulations!\n\nBefore my last day, I just wanted to take a moment to sincerely thank you.\n\nBefore the training team was formed, the DevOps team was truly grateful for your help in guiding our developers and testers. You took the lead in helping them understand Dispatch1 and how to manage tickets effectively. You were a great mentor, and because of your support, they were able to quickly grasp the application.\n\nYou’ve always made time to train others, even when you were busy with your own tasks and leading your team — and that didn’t go unnoticed. You truly deserved every MVP vote from me and from the DevOps team. Your effort, patience, and dedication made a real impact, and I deeply appreciate it.\n\nI’m genuinely grateful I had the chance to work with someone as talented and committed as you.\n\nWishing you continued success in everything you do.\n\nAll the best - Ramon",
"clay": "Hi Clay,\n\nAs I approach my last working day, I just wanted to take a moment to sincerely thank you.\n\nWorking with you has been one of the most meaningful parts of my journey here. You’ve been more than just a manager—you’ve been a mentor and a friend. I’ve learned a great deal under your leadership, and I’m genuinely grateful for the trust, guidance, and opportunities you’ve given me.\n\nThank you for always being approachable, for believing in my capabilities, and for supporting me through both challenges and growth. Your steady leadership and authentic care for the team left a lasting impression on me.\n\nI’m proud of what we’ve accomplished together, and I’ll carry those experiences with me moving forward. I’ll always look back on this chapter with deep appreciation.\n\nWishing you and the team continued success. I truly hope our paths cross again someday.\n\nWarm regards,\nRamon",
"matthew": "Hello Mat,\n\nBefore my last day, I want to thank you for your support and for trusting me in my leadership role. While we may not have always seen eye to eye, I’ve always respected you—as a teammate, a fellow QA, and most of all, as a thoughtful contributor to the team.\n\nOur app and processes wouldn’t be where they are today without your insights and efforts. We’ve grown together—from manual testing to automation—and I’ve genuinely appreciated that journey.\n\nIf I could leave you with one piece of advice: keep learning. You already have a strong foundation and a deep understanding of the system. Now is your time to step up and lead. You’ve got the openness, the curiosity, and the ability to make a real impact.\n\nI have high hopes for you, Mat. I believe you’ll achieve even more than I did. And who knows—someday, our paths might cross again, and maybe you’ll be the one running the QA team.\n\nWishing you all the best in your next chapter.\n\nTake care,\nRamon",
"alex": "Hello Alex,\n\nBefore my last day, I just wanted to say something from the heart.\n\nThank you for all the support you’ve given me, and thank you for the trust. You’re a talented developer and a strong leader. I’ve seen how you’ve handled the team, always doing your best to support everyone, and I truly respect that.\n\nI’ve had the chance to work with other great developers before, and I can honestly say you’re one of them. Your technical skills, calm approach, and dedication stand out. Keep growing, and always follow what your heart tells you. You’re already a great leader, but I believe you’re capable of doing so much more with your expertise and talent.\n\nEven though we’ve never met in person, I never saw you as just a colleague. To me, you’ve been more than that. I’m genuinely glad our paths crossed, and I got the chance to work with someone as talented as you.\n\nWishing you continued success and all the best in everything you do.\n\nHope to meet you when you visit here in Cebu.\n\nTake care – Ramon",
"craig": "Hello Craig,\n\nBefore my last day, I just wanted to take a moment to sincerely thank you.\n\nWe may not have had many conversations or a long time working together, but to be honest, ever since you joined the team, I felt like we were finally heading in the right direction. We’ve had leads before—Alex, Saravanan, and Clay—but something felt different when you came onboard. Your presence brought clarity, momentum, and a sense of alignment that I had long been hoping for.\n\nAs a QA, I’ve always done my best, especially when it comes to improving the user experience. But for a while, I felt like those efforts weren’t always seen or acted upon. When you arrived, it felt like the missing piece of the puzzle was finally in place. In such a short time, we were able to deliver strong features and fix long-standing issues, and that’s largely thanks to your leadership.\n\nI’ve worked with other project managers before, but I can honestly say you’re one of the best. Your approach, skills, and dedication really stood out and helped solve so many problems the team had been facing.\n\nI’m honestly a bit sad that our time working together was so short, but I’m truly grateful I had the chance to collaborate with someone as capable and driven as you.\n\nWishing you and the team continued success.\n\nAll the best – Ramon",
"chad": "Hello Chad,\n\nBefore my last day, I just wanted to take a moment to sincerely thank you.\n\nI’ve always admired you as a supportive and inspiring CEO. Your openness, vision, and leadership have made a strong impact on me and shaped how meaningful it has been to be part of this organization. I’ve never met a CEO as down to earth, thoughtful, and genuinely smart as you. Through your direction and goals, I was inspired to give my best, to contribute in any way I could, whether it was improving the applications, processes, or even the little things around the office.\n\nI’ve always treated Kinettix like it was my own company, which is why I became so deeply attached not just to the work, but to the purpose behind it. I wanted to improve the user experience, support others, and help wherever and whenever I could.\n\nI’m proud to have worn many hats during my time here—QA, Scrum Master, DevOps Manager, IT Operations Manager, and QA Manager. It’s been an incredible journey, and I’m truly honored by the trust that was placed in me. I’m especially grateful to you and to Clay for believing in me and giving me the opportunity to step into these roles. Those experiences not only helped me grow professionally but also deepened my commitment to the team and to the company’s success.\n\nFor years, I’ve been fully committed, focused on the work, supporting the team, and growing with the company. Serving as QA Manager has been a true honor. I’m proud of what we’ve accomplished, and I’m incredibly grateful for the trust and support you’ve given me throughout the journey.\n\nThank you for believing in me, for the opportunity to grow, and for creating a place where people like me could thrive.\n\nFrom the bottom of my heart, thank you for supporting my magic tricks. Thank you for all the cards you have given me. I will treasure those gifts and forever be grateful.\n\nWishing you and Kinettix continued success in everything ahead.\n\nWarm regards – Ramon",
"teresa": "Hi Miss Teresa,\n\nThank you so much for your kind and thoughtful message. I truly appreciate your understanding and the way you acknowledged both my decision and my time here at Kinettix.\n\nIt really means a lot to hear those words from you, especially as someone I’ve respected for your professionalism, values, and fairness. I’m grateful for the support and the positive experience I’ve had working alongside you and the rest of the team.\n\nThank you as well for confirming my final working day. I’ll make sure to continue doing my best and supporting a smooth transition during the remainder of my notice period.\n\nOnce again, thank you for the kind words and for the opportunity to be part of this team. I’ll carry the lessons and experiences with me moving forward.\n\nWishing you continued success, and I hope our paths cross again in the future.\n\nBest regards – Ramon",
"paulo": "Hello Paulo,\n\nBefore my last day, I just wanted to take a moment to sincerely thank you.\n\nThank you for joining Kinettix, your presence brought structure, clarity, and a true sense of what it means to follow Scrum practices. The teams became more organized and aligned because of your leadership and dedication.\n\nYou’re truly excellent at what you do, and without a doubt, a great Scrum Master. Watching how you facilitated and delivered Scrum activities inspired me to reflect on my own journey and reignited my passion for the role. Your work has made a real impact in helping the organization understand and embrace agile practices.\n\nI’m genuinely grateful I had the chance to work with someone as talented and committed as you.\n\nWishing you continued success in all that you do.\n\nTake care – Ramon",
  "liz": "Hello Liz,\n\nBefore my last day, I just wanted to take a moment to sincerely thank you.\n\nYou are truly one of the pillars of Kinettix. I’ve always admired your loyalty, sincerity, the way you treat your colleagues and friends, and the deep value you place on the company. You’ve taken on so much not just leading the Vendev team, but also handling recruitment and supporting multiple teams, yet you continue to excel with grace and efficiency.\n\nYou, along with the rest of the leadership team, are one of the reasons I’ve always strived to do my best. Your dedication and presence have been a source of inspiration, and I truly believe you are one of Kinettix’s most valuable and quietly exceptional team members.\n\nI’m genuinely grateful I had the chance to work with someone as talented, committed, and thoughtful as you.\n\nWishing you continued success in everything you do.\n\nWarm regards – Ramon",
  "rachel": "Hello Miss Rachel.\n\nFirst of all, thank you so much for your kind words. I truly appreciate it.\n\nI also want to thank you for hiring me and for all the support, advice, and understanding you’ve extended throughout my time here. Leading a team has its challenges, especially when it comes to personal matters, but it became manageable because I always felt your trust and guidance behind me.\n\nI’m especially grateful for the trust and encouragement you've shown me. It really meant a lot. This wasn’t an easy decision, especially because of the deep respect I have for Clay not just as a manager, but as a genuinely good person and a friend. As well as Chad for being so supportive.\n\nThank you again for everything, and I’m wishing you and the team all the best always. God bless! – Ramon",
  "kriff": "My friend Kriff,\n\nThank you for all the talks, the support, and for always taking the time to answer my questions no matter how small. You were a source of laughter and kindness, and we will always be grateful for that.\n\nI hope you’ve found peace and happiness wherever you are now.\n\nWe will remember your warmth, your generosity, and that unforgettable smile. You’ll be missed, but never forgotten.\n\nRest well, my friend.",
  "ben": "Ben,\n\nThank you so much for everything.\n\nI’m really grateful for all the support and collaboration over the years, and I want to especially thank you for stepping up and taking on the responsibilities Kriff left behind. It wasn’t an easy transition, but you handled it with focus, calm, and strength — and that says a lot about your character and leadership.\n\nHaving new perspectives in leadership has been good for the company, and your approach has brought positive changes that are truly felt. You’ve been doing an outstanding job, and your appointment as Operations Manager just proves the trust and confidence that management has in you — and rightly so.\n\nYou’ve always led by example, and it’s been a privilege to work with you. Thank you again, and I hope our paths cross again in the future.\n\nWishing you continued success.\n\n– Ramon",
  "luke": "Hello Luke,\n\nFirst of all—thank you for indulging my magic tricks! 😄 It honestly made my day every time you reacted or played along. It’s those small moments that made working at Kinettix even more special to me.\n\nI’m really glad I had the chance to know you and meet you in person.\n\nI’ve always treated Kinettix like it was my own, which is probably why I became so attached—not just to the work, but to the purpose behind it and the people who made it meaningful. I’ve always aimed to improve the experience for others, help wherever I could, and be someone the team could rely on. Having people like you around made that journey even more fulfilling.\n\nThank you for the opportunity to be part of the Kinettix family. Keep being awesome.\n\n– Ramon"
}
